# UnitVec

## Description
Returns the standard unit vector of the specified vector.

```pascal
FUNCTION UnitVec(Vect : VECTOR) : VECTOR;
```

```python

def vs.UnitVec(Vect):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|Vect|VECTOR|Source vector.|

## Returns
Returns a VECTOR.

## Version
Availability: from MiniCAD
## Category
* Math - Vectors